{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "name": "lambda_2", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32", "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-26-40dc0e86cca5>\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D1", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 1, "trainable": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "bias": true, "nb_col": 1, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 3, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D2", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 8, "trainable": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "bias": true, "nb_col": 8, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 16, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPoolC2", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "DropoutC2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D3", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 5, "trainable": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "bias": true, "nb_col": 5, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 32, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPoolC3", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "DropoutC3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D4", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "trainable": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 32, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPoolC4", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "DropoutC4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "Conv2Dense", "trainable": true}}, {"class_name": "Dense", "config": {"name": "Dense1", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 256, "input_dim": 1088, "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "DropoutD1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "Dense2", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 128, "input_dim": 256, "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "DropoutD2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "Dense3", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 64, "input_dim": 128, "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "DropoutD3", "trainable": true}}, {"class_name": "Dense", "config": {"name": "Dense4", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 8, "input_dim": 64, "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "DropoutD4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "Output", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 1, "input_dim": 8, "activity_regularizer": null, "trainable": true, "b_constraint": null}}], "keras_version": "1.2.0"}